#list 자료형
a=[1,2,[3,4],'5'] #리스트 안에는 어떠한 자료형도 포함 할 수 있다.
#indexing and slicing 문자열처럼 리스트도 가능하다
#indexing a[0]는 첫번째, a[-1]은 마지막요소
#slicing a[i:j] i번쨰~ j-1번째 까지 슬라이싱

#list 연산, 문자열과 마찬가지로 더하기와 곱하기 모두가능!
#add list
a=[1,2,3]
b=[4,5,6]
print(a+b) #그냥 단순하게 이어붙이는 것이 더하기 !!!
#각요소를 더할려면?
c=[]
for i in range(len(a)):
    c=c+[a[i]+b[i]] #리스트의 덧셈을 이용한 방법
    #또는 c.append(a[i]+b[i])
print(c)

#multiple list(*)
a=[1,2,3]
print(a*3) #세번 반복되어 더해진 리스트 ,길이구하기 =len() 이용

#len()함수: 문자열, 리스트, 튜플, 딕셔너리 모두 활용가능 !!!!!!

#리스트는 요소 수정 및 삭제가 가능하다

a=[1,2,3]
a[2]=5 #수정
print(a)

#리스트의 삭제 방법 1. del 이용하기
del(a[1]) #삭제 주의:리스트각 요소의 번호도 다 바뀐다. !
print(a)
del(a[:1]) #한꺼번에 여러개 삭제가능
print(a)
#삭제방법 2. remove 이용하기-->리스트에서 첫번째로 나오는 (x)를 삭제해준다
a=[1,2,3,1,2,3]
a.remove(1)
print(a) #한번더 remove 를 실행하면 다음번 1이 삭제된다 !!
#삭제방법 3. pop 함수 이용하기 --> x번째 요소를 돌려주고 그 요소는 삭제한다. !
a=[1,2,3]
pop1=a.pop(2)
print(a,pop1)

#리스트 관련 다른 함수들
a=[1,2,3]
a.append(4) #리스트 가장 마지막에 4 추가
a=[1,2,3]
a.insert(1,'3') #index가 1인 장소에 문자 '3'을 넣는다.
a.insert(2,4) #index가 2인 장소에 숫자 4를 넣는다.
print(a)

a=[1,2,3]
a.sort() #리스트를 정렬해준다 숫자는 오름차순, 문자는 알파벳 순서대로!
a=[1,2,3]
a.reverse() #이 reverse 함수의 출력값은 None이고 이는 a 그 자체를 역수로 뒤집어준다. !!!
print(a)

a=[1,2,3]
b=a[:] #이거는 a의 카피를 만든것이고
b.reverse()
print(a,b)

a=[1,2,3]
b=a #이거는 a의 주소 자체를 b랑 똑같이 연결한 것이기 때문에 이렇게 쓰면 둘다 바뀐다!! 주의
b.reverse()
print(a,b)

a=[1,2,3,'4']
print(a.index('4')) #문자 4이 처음으로 나오는 위치를 반환해준다. 
print(a.index(2))

a=[1,2,2,3]
print(a.count(2)) #해당요소가 몇개나 있는지를 반환한다
a.extend([4,5,6]) #이함수에는 반드시 리스트만 포함가능하며, 이것으로 리스트를 확장시켜준다.
#즉 extend 함수는  a=a+[list] 와 동일한 효과를 지닌다!!
print(a)

