#bool 자료형 True / False
#자료형의 참과 거짓 
#문자열,리스트,튜플,딕셔너리 등의 값이 비어있으면 거짓,비어있지 않으면 참이다.
#숫자가 0이면 거짓 0이 아니면 참이다
#None은 거짓이다.
#bool() 활용하면 True or False를 반환해준다
bool('hi') #True
bool([]) #False

#자료형의 값을 저장하는 공간, 변수(variable)
#변수이름=변수에 저장할 값
#다른 언어 C,Java 에서는 자료형을 직접 지정해야 하지만, 파이썬은 변수에 저장된 값을 스스로 판단하여 자료형을 지정해준다
#파이썬에서의 변수란, 객체이다(객체==자료형 과 유사한 의미)
a=[1,2,3] #에서 리스트 자료형(객체) 가 자동으로 파이썬에서 메모리에서 생성되고,
#그리고 변수 a는 [1,2,3] 값 이 저장된 메모리의 주소를 가르키게 된다!!(메모리의 주소를 가르킴)
#변수 a가 가르키는 주소는 id(a) 를 통해 확인할수있다. 같은 주소를 가르키면 같은 값이 된다

##주의!!!!!!!!!!!!!!리스트를 복사할때 주의하자
b=a #동일한 객체를 활용 즉, [1,2,3]리스트를 참조하는 (reference) 변수가 a한개에서 b가추가되어 2개가 된것일뿐
print(b,id(a),id(b)) #a is b == True
#만약 같은 객체를 사용하면, 하나를 바꾸면 다른 하나도 자동으로 그 안에 저장된 값이 바뀌므로 주의

#b변수를 생성할때 a의 값을 가져오면서,다른 주소를 가르키게 하는법--> 해결방법 1.[:] 2.copy모듈이용
b=a[:] #새로운 객체를 생성한다,a를 슬라이싱
print(b,id(a),id(b))
#방법 2. copy 모듈이용 
from copy import copy
a=[1,2,3]
b=copy(a) #b=a[:] 와 동일효과
print(b,id(b),id(a),b is a)

#파이썬에서 변수 생성방법
a,b=('python','life') #튜플로 생성
a,b='python','life' #괄호를 생략한 튜플로 생성
[a,b]=['python','life'] #리스트를 이용하여 생성
a=b='python' #한꺼번에 같은 값으로 생성
a=3
b=5
a,b=b,a #서로 값을 바꾸는 간단한 방법
print(a,b)